/*--------------------------------------------------------------|
 *| company | 湖南华中苗木云科技有限公司                        |
 *|-------------------------------------------------------------|
 *| date    | 2019-09-20                                        |
 *|-------------------------------------------------------------|
 *| author  | 冯  辉                                            |
 *|-------------------------------------------------------------|
 *| contact | QQ:258820709    email:fenghuibox@qq.com           |
 *|-------------------------------------------------------------*/
 

#if 1

#ifndef __ZGB_MAC_H
#define __ZGB_MAC_H


#include "com_typedef.h"





//===========================================================


extern u8 macMyGet(u8 *pMac );



extern u8 macToHexStr( u8 *pMac, u8 *pMacHexStr  );


extern u8 macMyHexStrGet(u8 *pMacHexStr );


extern u8 macIsNode( u8 *pMac );

//===========================================================


extern u8 macIsOk( u8 *pMac );




#endif

#endif


