/*--------------------------------------------------------------|
 *| company | 湖南华中苗木云科技有限公司                        |
 *|-------------------------------------------------------------|
 *| date    | 2019-09-20                                        |
 *|-------------------------------------------------------------|
 *| author  | 冯  辉                                            |
 *|-------------------------------------------------------------|
 *| contact | QQ:258820709    email:fenghuibox@qq.com           |
 *|-------------------------------------------------------------*/




//====================================================================================
//===== // step 3 =====发送命令=======================================================
//====================================================================================

/*--------------------------------------------------------------------------
读取本地配置	
AB BC CD D1 AA	
AB BC CD D1 DEV_INFO结构信息  运行状态   协议类型  固件版本
                  65 字节      1 字节  2 字节      2 字节

运行状态：0xAA 该参数保留
协议类型：0x0003
固件版本：模块的固件版本号，如模块固件版本号为 V1.02，固件版本的值为 0x01、0x02。
--------------------------------------------------------------------------*/
static void _zcmdDevInfoGet( void )
{
	const u8 pCmd[ZCMD_FOREVER_HEAD_ID_DEV_INFO_GET_LEN] = {0xAB, 0xBC, 0xCD, 0xD1, 0xAA};

	zgbUartTx((u8 *)pCmd, ZCMD_FOREVER_HEAD_ID_DEV_INFO_GET_LEN );
}


/*--------------------------------------------------------------------------
3 字节（协议标志） 1 字节   2 字节     65 字节           1 字节（帧尾）
      AB BC CD        D6    网络地址   DEV_INFO 结构信息  AA
--------------------------------------------------------------------------
修改本机配置时，只需在命令中填本地网络地址即可。

应答报文 AB BC CD D6 20 01 00

--------------------------------------------------------------------------*/
static void _zcmdDevInfoSet( void )
{
	//ST_ZIGBEE_DEV_INFO *pstInfo;
	
	u8 pCmd[ ZCMD_FOREVER_HEAD_ID_DEV_INFO_SET_LEN ] = {0xAB, 0xBC, 0xCD, 0xD6};


	if( 0 == _stZcmdPara.isOk )
		return;

	u16splitToByteLH( _stZdevInfo.MyAddr , pCmd + ZCMD_FOREVER_HEAD_ID_DEV_INFO_SET_NETADDR_OFFSET );
		
	memcpy( pCmd + ZCMD_FOREVER_HEAD_ID_DEV_INFO_SET_DEV_INFO_OFFSET, &_stZdevInfo, sizeof(ST_ZIGBEE_DEV_INFO) );

	//modUartDebugTxU8buf( pCmd, ZCMD_FOREVER_HEAD_ID_DEV_INFO_SET_LEN );
	
	pCmd[ ZCMD_FOREVER_HEAD_ID_DEV_INFO_SET_LEN - 1 ] = ZCMD_FOREVER_TAIL_BYTE;

	zgbUartTx( pCmd, ZCMD_FOREVER_HEAD_ID_DEV_INFO_SET_LEN );

	/*
	171 188 205 214 
 	0 1
	90 76 71 32 68 101 118 105 99 101 0 0 0 0 0 0 
	56 56 56 56 56 0 0 0 0 0 0 0 0 0 0 0 0 
	25 
	250 207 
	0 1 
	4 168 8 104 0 21 141 0 
	85 76 
	90 76 71 0 0 0 128 2 
	0 
	2 
	4 
	7 
	6 8 1 0 0 
	170
	*/
}



/*--------------------------------------------------------------------------
复位命令
--------------------------------------------------------------------------
3 字节（协议标志）    1 字节    2 字节      2 字节     1 字节（帧尾）
   AB BC CD           D9        网络地址   协议类型        AA
--------------------------------------------------------------------------
CMD: AB BC CD D9 20 01 00 03 AA 
复位帧无应答 
--------------------------------------------------------------------------*/
static void _zcmdReboot( void )
{
	u8 pCmd[ZCMD_FOREVER_HEAD_ID_REBOOT_LEN] = {0xAB, 0xBC, 0xCD, 0xD9, 0x00, 0x00, 0x00, 0x03, 0xAA};
	
	*((u16 *)(pCmd + 4)) = _stZdevInfo.MyAddr;

	zgbUartTx( pCmd, ZCMD_FOREVER_HEAD_ID_REBOOT_LEN );

	_stZcmdTx.reboot = 0;
}




/*--------------------------------------------------------------------------
恢复出厂设置命令
--------------------------------------------------------------------------
3 字节（协议标志）  1 字节    2 字节     2 字节     1 字节（帧尾）
      AB BC CD        DA     网络地址    协议类型      AA
--------------------------------------------------------------------------
CMD: AB BC CD DA 20 01 00 03 AA
RSP: AB BC CD DA 20 01 00 03 00

注意: 需要 RESET
--------------------------------------------------------------------------*/
static void _zcmdDef( void )
{
	
	u8 pCmd[ZCMD_FOREVER_HEAD_ID_DEF_LEN] = {0xAB, 0xBC, 0xCD, 0xDA, 0x00, 0x00, 0x00, 0x03, 0xAA};
	
	*((u16 *)(pCmd + 4)) = _stZdevInfo.MyAddr;

	zgbUartTx( pCmd, ZCMD_FOREVER_HEAD_ID_DEF_LEN );
}






/*--------------------------------------------------------------------------
启用自组网功能命令
--------------------------------------------------------------------------
3 字节（协议标志） 1 字节     1 字节        1 字节     1 字节（帧尾）
AB BC CD             E5      自组网使能     节点类型     AA
--------------------------------------------------------------------------
使能  0：自组网功能关闭(默认)
类型  0：主机节点

CMD: AB BC CD E5 01 01 AA  // 设置模块使能自组网功能，节点为从机节点
RSP: AB BC CD E5 01 01 00
--------------------------------------------------------------------------*/
static void _zcmdAutoNet( void )
{
	u8 pCmd[ZCMD_FOREVER_HEAD_ID_AUTO_NET_LEN] = {0xAB, 0xBC, 0xCD, 0xE5, 0x00, 0x00, 0xAA};

	pCmd[4] = _stZcmdPara.autoNet;
	
	zgbUartTx( pCmd, ZCMD_FOREVER_HEAD_ID_AUTO_NET_LEN );
}




/*--------------------------------------------------------------------------
查询主从机状态
--------------------------------------------------------------------------
3 字节（协议标志）   1 字节     1 字节（帧尾）
AB BC CD             E8           AA
--------------------------------------------------------------------------
CMD: AB BC CD E8 AA
RSP: AB BC CD E8 00 00 // 主机处于空闲状态
--------------------------------------------------------------------------
主机返回的状态值
-------------------------
00 主机空闲
01 主机正在检测网络
02 主机允许从机加入网络
-------------------------
从机返回的状态值
-------------------------
00 从机正在加入网络
01 从机已加入网络
02 从机已退出网络
--------------------------------------------------------------------------*/
static void _zcmdWorkStateGet( void )
{
	const u8 pCmd[] = {0xAB, 0xBC, 0xCD, 0xE8, 0xAA};

	zgbUartTx( (u8 *)pCmd, ZCMD_FOREVER_HEAD_ID_WORK_STATE_LEN );
}







/*---------------临时参数配置---------------------------------------------
查询节点的信号强度命令
--------------------------------------------------------------------------

--------------------------------------------------------------------------
CMD: DE DF EF DA 20 02 // 获取模块的信号强度
RSP: DE DF EF DA 20 02 BA // 获取到的信号强度为 0xBA

获取到的信号强度是本机模块与目标模块 2002 之间的信号强度。

注：所获信号强度是 LQI 链路质量指示的值，范围：0~255，值越大，信号越好。
--------------------------------------------------------------------------*/
static void _zcmdLqiGet( void )
{	
	u8 pCmd[ZCMD_TEMP_HEAD_ID_LQI_LEN] = {0xDE, 0xDF, 0xEF, 0xDA};

	*((u16 *)(pCmd + 4)) = _stZdevInfo.DstAddr;
	
	zgbUartTx( pCmd, ZCMD_TEMP_HEAD_ID_LQI_LEN );
}






/*---------------临时参数配置---------------------------------------------
进入休眠命令
--------------------------------------------------------------------------
其功能码为 0xD8，命令长度为 5 个字节，其参数为 0x01，表示进入深度休眠状态；命
令参数为其它值，则表示无效。当接收到此命令后，模块进入休眠状态，无返回值。
--------------------------------------------------------------------------
CMD: DE DF EF D8 01 // 模块进入深度休眠

休眠命令无返回，进入休眠后不保存临时参数配置，可通过复位模块或拉低 17 管脚进
行唤醒，模块被唤醒后，所有管脚将恢复到初始状态。

--------------------------------------------------------------------------*/
static void _zcmdSleep( void )
{	
	u8 pCmd[ZCMD_TEMP_HEAD_ID_SLEEP_LEN] = {0xDE, 0xDF, 0xEF, 0xD8, 0x01};
	
	zgbUartTx( pCmd, ZCMD_TEMP_HEAD_ID_SLEEP_LEN );

	_stZcmdTx.sleep = 0;
}




