/*--------------------------------------------------------------|
 *| company | 湖南华中苗木云科技有限公司                        |
 *|-------------------------------------------------------------|
 *| date    | 2019-09-20                                        |
 *|-------------------------------------------------------------|
 *| author  | 冯  辉                                            |
 *|-------------------------------------------------------------|
 *| contact | QQ:258820709    email:fenghuibox@qq.com           |
 *|-------------------------------------------------------------*/
 

#ifndef __ZGB_IO_H
#define __ZGB_IO_H


#include "com_typedef.h"


//---------sleep----------------------------------------------------------

extern void modIoZgbSleep( void );



//---------reset----------------------------------------------------------

extern void modIoZgbReset( void );




//---------wakeup----------------------------------------------------------

extern void modIoZgbWakeup( void );





//---------detect----------------------------------------------------------

extern void modIoZgbDetect( void );





//---------ACK-------- IN --------------------------------------------------

// 1 要求先调用  modIoZgbAckCheckStart()
// 2 check 时长 : _ZGB_ACK_TIMEOUT_MS
extern u8 modIoZgbAckGet( void );



extern void modIoZgbAckCheckStart( void );






//-------------------------------------------------------------------
extern void zgbIoInit( void );



#endif

