/*--------------------------------------------------------------|
 *| company | 湖南华中苗木云科技有限公司                        |
 *|-------------------------------------------------------------|
 *| date    | 2019-09-20                                        |
 *|-------------------------------------------------------------|
 *| author  | 冯  辉                                            |
 *|-------------------------------------------------------------|
 *| contact | QQ:258820709    email:fenghuibox@qq.com           |
 *|-------------------------------------------------------------*/
 
#if 1

#include "com_includes.h"


//#include "dbg_uart.h"



static void _wdtInit(void)
{
    ///< WDT 初始化
    Wdt_Init( WdtResetEn, WdtT13s1 );
}















void iwdgRefresh( void )
{
	Wdt_Feed(); // 喂狗
}


void iwdgInit( void )
{
	_wdtInit();
}


#endif


