/*--------------------------------------------------------------|
 *| company | 湖南华中苗木云科技有限公司                        |
 *|-------------------------------------------------------------|
 *| date    | 2019-09-20                                        |
 *|-------------------------------------------------------------|
 *| author  | 冯  辉                                            |
 *|-------------------------------------------------------------|
 *| contact | QQ:258820709    email:fenghuibox@qq.com           |
 *|-------------------------------------------------------------*/
 

#if 1

#ifndef __F_RESPONSE_FRAME_H
#define __F_RESPONSE_FRAME_H


#include "com_typedef.h"

#include "f_frame_comm.h"
#include "f_txt_frame_data.h"

/*
*****简单应答帧格式（支持 通信端识别的 版本） rsp:  response  响应*****	
-----------------------------------------------------------------------
帧成员名	字节数	                     解释                      
-----------------------------------------------------------------------
帧开始	      1	      值：0xAA。
-----------------------------------------------------------------------
帧长度	      1	      帧的总字节数。
-----------------------------------------------------------------------
帧版本	      1	       
                       bit6:   通信端标志(1:节点与网关 0:节点与服务器)。
                       bit5-0: 帧格式的版本号。
-----------------------------------------------------------------------
校验和	      1	      所有帧数据按无符号数单字节累加，忽略溢出。
-----------------------------------------------------------------------
目标ID	      8	      产品ID。                                      
-----------------------------------------------------------------------
会话ID	      1	      详见相关章节的描述。                           
-----------------------------------------------------------------------
简单应答值    1	      详见简单应答帧的值定义。
-----------------------------------------------------------------------
帧结束	      1	      值：0x88。
-----------------------------------------------------------------------*/




//------------------------------------------------------
#define  RSP_FRAME_ELE_LEN_HEAD       (1)
#define  RSP_FRAME_ELE_LEN_LEN        (1)
#define  RSP_FRAME_ELE_LEN_VER        (1)
#define  RSP_FRAME_ELE_LEN_CHECK      (1)
#define  RSP_FRAME_ELE_LEN_TARGET_ID  (8)
#define  RSP_FRAME_ELE_LEN_SID        (1)
#define  RSP_FRAME_ELE_LEN_RSP_VAL    (1)
#define  RSP_FRAME_ELE_LEN_TAIL       (1)



//------------------------------------------------------
#define RSP_FRAME_LEN  ( RSP_FRAME_ELE_LEN_HEAD + RSP_FRAME_ELE_LEN_LEN + RSP_FRAME_ELE_LEN_VER + \
	                     RSP_FRAME_ELE_LEN_CHECK + RSP_FRAME_ELE_LEN_TARGET_ID + \
	                     RSP_FRAME_ELE_LEN_SID +  RSP_FRAME_ELE_LEN_RSP_VAL + RSP_FRAME_ELE_LEN_TAIL )




//------------------------------------------------------
#define RSP_FRAME_OFFSET_HEAD          (0)
#define RSP_FRAME_OFFSET_LEN           (RSP_FRAME_OFFSET_HEAD      + RSP_FRAME_ELE_LEN_HEAD)
#define RSP_FRAME_OFFSET_VER           (RSP_FRAME_OFFSET_LEN       + RSP_FRAME_ELE_LEN_LEN)
#define RSP_FRAME_OFFSET_CHECK         (RSP_FRAME_OFFSET_VER       + RSP_FRAME_ELE_LEN_VER)
#define RSP_FRAME_OFFSET_TARGET_ID     (RSP_FRAME_OFFSET_CHECK     + RSP_FRAME_ELE_LEN_CHECK)
#define RSP_FRAME_OFFSET_SID           (RSP_FRAME_OFFSET_TARGET_ID + RSP_FRAME_ELE_LEN_TARGET_ID)
#define RSP_FRAME_OFFSET_RSP_VAL       (RSP_FRAME_OFFSET_SID       + RSP_FRAME_ELE_LEN_SID)
#define RSP_FRAME_OFFSET_TAIL          (RSP_FRAME_OFFSET_RSP_VAL   + RSP_FRAME_ELE_LEN_RSP_VAL)



//------------------------------------------------------
#define RSP_FRAME_START  (0xAA)
#define RSP_FRAME_END    (0x88)
#define RSP_FRAME_VER    (0x00)



// 通信端标志 Communication terminal flag
#define  RSP_FRAME_VER_BIT_ID_COMM_TERMINAL        (0x40)
#define  RSP_FRAME_VER_BIT_MASK                    (RSP_FRAME_VER_BIT_ID_COMM_TERMINAL)








extern EN_FRAME_UNPACK rspFrameUnpackNotMac( u8 *pFrame, u8 len );






/* *********************** rsp frame 解码 *****************************  
-----------------------------------------------------------------------
帧成员名	字节数	                     解释                      
-----------------------------------------------------------------------
帧开始	      1	      值：0xAA。
-----------------------------------------------------------------------
帧长度	      1	      帧的总字节数。
-----------------------------------------------------------------------
帧版本	      1	       
                       bit6:   通信端标志(1:节点与网关 0:节点与服务器)。
                       bit5-0: 帧格式的版本号。
-----------------------------------------------------------------------
校验和	      1	      所有帧数据按无符号数单字节累加，忽略溢出。
-----------------------------------------------------------------------
目标ID	      8	      产品ID。                                      
-----------------------------------------------------------------------
会话ID	      1	      详见相关章节的描述。                           
-----------------------------------------------------------------------
简单应答值    1	      详见简单应答帧的值定义。
-----------------------------------------------------------------------
帧结束	      1	      值：0x88。
-----------------------------------------------------------------------
*/
extern EN_FRAME_UNPACK rspFrameUnpack( u8 *pFrame, u8 len, u8 isNode );








/* *********************** rsp frame 创建  *****************************  
-----------------------------------------------------------------------
帧成员名	字节数	                     解释                      
-----------------------------------------------------------------------
帧开始	      1	      值：0xAA。
-----------------------------------------------------------------------
帧长度	      1	      帧的总字节数。
-----------------------------------------------------------------------
帧版本	      1	       
                       bit6:   通信端标志(1:节点与网关 0:节点与服务器 and 网关与服务器, )。
                       bit5-0: 帧格式的版本号。
-----------------------------------------------------------------------
校验和	      1	      所有帧数据按无符号数单字节累加，忽略溢出。
-----------------------------------------------------------------------
目标ID	      8	      产品ID。                                      
-----------------------------------------------------------------------
会话ID	      1	      详见相关章节的描述。                           
-----------------------------------------------------------------------
简单应答值    1	      详见简单应答帧的值定义。
-----------------------------------------------------------------------
帧结束	      1	      值：0x88。
-----------------------------------------------------------------------
*/
extern void resFrameCreate( ST_RSP_FRAME *pstRspFrame, u8 isNodeAndGateway );









//=======================================
//========追加===========================
//=======================================
extern u8 rspFrameLenIsOk( u8 len );




#endif

#endif


