/*--------------------------------------------------------------|
 *| company | 湖南华中苗木云科技有限公司                        |
 *|-------------------------------------------------------------|
 *| date    | 2019-09-20                                        |
 *|-------------------------------------------------------------|
 *| author  | 冯  辉                                            |
 *|-------------------------------------------------------------|
 *| contact | QQ:258820709    email:fenghuibox@qq.com           |
 *|-------------------------------------------------------------*/
 

#ifndef ___DBG_CMD_MAC_H
#define ___DBG_CMD_MAC_H


#include "com_typedef.h"

extern const char strCmdMacHead[];

#define DEBUG_MAC_HEAD_LEN   (3)



extern u8 debugCmdMac( u8 *str,  u8 len );



#endif

