/*--------------------------------------------------------------|
 *| company | 湖南华中苗木云科技有限公司                        |
 *|-------------------------------------------------------------|
 *| date    | 2019-09-20                                        |
 *|-------------------------------------------------------------|
 *| author  | 冯  辉                                            |
 *|-------------------------------------------------------------|
 *| contact | QQ:258820709    email:fenghuibox@qq.com           |
 *|-------------------------------------------------------------*/
 
#if 0

#ifndef __SG_TX_ARR_H
#define __SG_TX_ARR_H

// sg: Server and gateway communication  服务器和网关通信

#include "com_typedef.h"










extern void sgTxArrInit( void );





#endif


#endif



